[Demo_Maya_ep7_1_ENG GG2CollectionDemoScript]
DemoScripts[0]=(Actor=FADE,Command=SET,SecTime=0,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=-1100,Y=-1940,Z=135),SecTime=)
DemoScripts[2]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=180,Y=-5,Z=0),SecTime=)
DemoScripts[3]=(Actor=CHARACTER,Command=POP,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Vec=(X=-1290,Y=-1940,Z=0),VecSub=(X=0,Y=0,Z=0),CId=71)
DemoScripts[4]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[5]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0002_lp_open_perplex",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[6]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_CMN_Decision.GG2_BGM_DM_CMN_Decision_Cue')
DemoScripts[7]=(Actor=AMBIENT,Command=PLAY,SecTime=0,SoundID=SoundCue'AMB_Campus_2.GG2_AMB_Campus_2_LP_Cue')
DemoScripts[8]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[9]=(Actor=FADE,Command=WAIT)
DemoScripts[10]=(Actor=WINDOW,Command=SET)
DemoScripts[11]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep7_1.GG2_V_Maya_ep7_1_001_Cue',Name="エコロ")
DemoScripts[12]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[13]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[14]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[15]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[16]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0100_lp_close_normal",Rate=0,Number=0,Bit=1)
DemoScripts[17]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep7_1.GG2_V_Maya_ep7_1_004_Cue',Name="エコロ")
DemoScripts[18]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[19]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[20]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",Rate=0,Number=0,Bit=1)
DemoScripts[21]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep7_1.GG2_V_Maya_ep7_1_005_Cue',Name="エコロ")
DemoScripts[22]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[23]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[24]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[25]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[26]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0101_lp_close_smile",Rate=0,Number=0,Bit=1)
DemoScripts[27]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0002_fx_close_smile_S",Rate=0,Number=1,Bit=0)
DemoScripts[28]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep7_1.GG2_V_Maya_ep7_1_008_Cue',Name="エコロ")
DemoScripts[29]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[30]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[31]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0000_lp_open_normal",Rate=0,Number=0,Bit=1)
DemoScripts[32]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep7_1.GG2_V_Maya_ep7_1_009_Cue',Name="エコロ")
DemoScripts[33]=(Actor=TEXT,Command=SET,ID=TEXT09)
DemoScripts[34]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[35]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep7_1.GG2_V_Maya_ep7_1_010_Cue',Name="エコロ")
DemoScripts[36]=(Actor=TEXT,Command=SET,ID=TEXT10)
DemoScripts[37]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[38]=(Actor=TEXT,Command=SET,ID=TEXT11)
DemoScripts[39]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0002_lp_open_perplex",Rate=0,Number=0,Bit=1)
DemoScripts[40]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0000_fx_close_normal",Rate=0,Number=1,Bit=0)
DemoScripts[41]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep7_1.GG2_V_Maya_ep7_1_012_Cue',Name="エコロ")
DemoScripts[42]=(Actor=TEXT,Command=SET,ID=TEXT12)
DemoScripts[43]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[44]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",Rate=0,Number=0,Bit=1)
DemoScripts[45]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0000_fx_close_normal",Rate=0,Number=1,Bit=0)
DemoScripts[46]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep7_1.GG2_V_Maya_ep7_1_013_Cue',Name="エコロ")
DemoScripts[47]=(Actor=TEXT,Command=SET,ID=TEXT13)
DemoScripts[48]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[49]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep7_1.GG2_V_Maya_ep7_1_014_Cue',Name="エコロ")
DemoScripts[50]=(Actor=TEXT,Command=SET,ID=TEXT14)
DemoScripts[51]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[52]=(Actor=TEXT,Command=SET,ID=TEXT15)
DemoScripts[53]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0100_lp_close_normal",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0102_fx_Stand2Displease",Rate=0,Number=3,Bit=1)
DemoScripts[54]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0200_lp_Displease",Number=8)
DemoScripts[55]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep7_1.GG2_V_Maya_ep7_1_016_Cue',Name="エコロ")
DemoScripts[56]=(Actor=TEXT,Command=SET,ID=TEXT16)
DemoScripts[57]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[58]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep7_1.GG2_V_Maya_ep7_1_017_Cue',Name="エコロ")
DemoScripts[59]=(Actor=TEXT,Command=SET,ID=TEXT17)
DemoScripts[60]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[61]=(Actor=TEXT,Command=SET,ID=TEXT18)
DemoScripts[62]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0000_lp_open_normal",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0201_fx_Displease2Stand",Rate=0,Number=3,Bit=1)
DemoScripts[63]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[64]=(Actor=TEXT,Command=SET,ID=TEXT19)
DemoScripts[65]=(Actor=TEXT,Command=SET,ID=TEXT20)
DemoScripts[66]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0101_lp_close_smile",motionName[1]="ek_CM_0002_fx_close_smile_S",motionName[2]="ek_DM_0111_fx_Stand2Proud",Rate=0,Number=3,Bit=1)
DemoScripts[67]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_1100_lp_Proud",Number=8)
DemoScripts[68]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep7_1.GG2_V_Maya_ep7_1_021_Cue',Name="エコロ")
DemoScripts[69]=(Actor=TEXT,Command=SET,ID=TEXT21)
DemoScripts[70]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[71]=(Actor=TEXT,Command=SET,ID=TEXT22)
DemoScripts[72]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0000_lp_open_normal",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_1101_fx_Proud2Stand",Rate=0,Number=3,Bit=1)
DemoScripts[73]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[74]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep7_1.GG2_V_Maya_ep7_1_023_Cue',Name="エコロ")
DemoScripts[75]=(Actor=TEXT,Command=SET,ID=TEXT23)
DemoScripts[76]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[77]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0002_lp_open_perplex",Rate=0,Number=0,Bit=1)
DemoScripts[78]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep7_1.GG2_V_Maya_ep7_1_024_Cue',Name="エコロ")
DemoScripts[79]=(Actor=TEXT,Command=SET,ID=TEXT24)
DemoScripts[80]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[81]=(Actor=TEXT,Command=SET,ID=TEXT25)
DemoScripts[82]=(Actor=SOUND,Command=PLAY,SoundID=SoundCue'SE_DM_Common.GG2_SE_Manpu_Wonder_Cue')
DemoScripts[83]=(Actor=EMOTION,Command=SET,Name="エコロ",Number=3,CId=71)
DemoScripts[84]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0000_lp_open_normal",Rate=0,Number=0,Bit=1)
DemoScripts[85]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep7_1.GG2_V_Maya_ep7_1_026_Cue',Name="エコロ")
DemoScripts[86]=(Actor=TEXT,Command=SET,ID=TEXT26)
DemoScripts[87]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[88]=(Actor=WINDOW,Command=EXIT)
DemoScripts[89]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[90]=(Actor=AMBIENT,Command=STOP,SecTime=2,SoundID=)
DemoScripts[91]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_BLACK,FadePriority=FADE_PRIO_BACK)
DemoScripts[92]=(Actor=FADE,Command=WAIT)
DemoScripts[93]=(Actor=SOUND,Command=PLAY,SoundID=SoundCue'SE_DM_Maya_ep7_1.GG2_SE_DM_Phone_Call_2_Cue')
DemoScripts[94]=(Actor=SYSTEM,Command=WAIT,SecTime=5)
DemoScripts[95]=(Actor=WINDOW,Command=SET)
DemoScripts[96]=(Actor=TEXT,Command=SET,ID=TEXT27)
DemoScripts[97]=(Actor=TEXT,Command=SET,ID=TEXT28)
DemoScripts[98]=(Actor=WINDOW,Command=EXIT)
DemoScripts[99]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[100]=(Actor=SYSTEM,Command=END)

[Select_Maya_ep7_1_ENG GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_Maya_ep7_1_ENG GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="艾可蘿",Text="祈禱姊姊的幸福,相信命運的想法....../n那就是真夜大人的守護者/n--心靈之壁的真面目吧......")

Texts[1]=(Label="TEXT02",Name="峯大",Text="難怪會那麼強啊......")

Texts[2]=(Label="TEXT03",Name="峯大",Text="艾可蘿......真的是像小真夜說的那樣,/n我現在的心情是因為天使之箭的力量/n而扭曲了嗎......?")

Texts[3]=(Label="TEXT04",Name="艾可蘿",Text="......")

Texts[4]=(Label="TEXT05",Name="艾可蘿",Text="要是我說\"沒錯\"的話/n你要怎麼辦?")

Texts[5]=(Label="TEXT06",Name="峯大",Text="......嗯.")

Texts[6]=(Label="TEXT07",Name="峯大",Text="抱歉,問了這種問題,/n我果然辦不到啊./n要我放棄小真夜什麼的,絕對做不到.")

Texts[7]=(Label="TEXT08",Name="艾可蘿",Text="呵呵....../n我也是這麼想的.")

Texts[8]=(Label="TEXT09",Name="艾可蘿",Text="請放心./n峯大大人現在的心情/n毫無疑問是峯大大人自己的唷.")

Texts[9]=(Label="TEXT10",Name="艾可蘿",Text="要是天使之箭的效果對你也會/n產生影響的話,你現在應該已經/n變成了毫無節操的猴子才對.")

Texts[10]=(Label="TEXT11",Name="峯大",Text="這樣啊......稍微放心點了呢./n每當看到步步進逼的女孩子們,/n我就會想......該不會也有那種事吧.")

Texts[11]=(Label="TEXT12",Name="艾可蘿",Text="本來還以為你變得有男子氣概了點,/n結果關鍵的部分果然還是很遜呢.")

Texts[12]=(Label="TEXT13",Name="艾可蘿",Text="我一開始就說過了哦./n\"由自己以外的人決定命運,/n你會覺得滿足嗎?\"")

Texts[13]=(Label="TEXT14",Name="艾可蘿",Text="\"請把手放在胸口好好想想看./n你真正喜歡的....../n你所愛的人是誰呢?\"")

Texts[14]=(Label="TEXT15",Name="峯大",Text="艾可蘿......")

Texts[15]=(Label="TEXT16",Name="艾可蘿",Text="命運是由自己親手掌握的./n因為是我這個精英天使說的,/n所以不會有錯.")

Texts[16]=(Label="TEXT17",Name="艾可蘿",Text="反正占星術師的占卜/n恐怕也只是算出機率最高的未來,/n就像是天氣預報一樣的東西啦.")

Texts[17]=(Label="TEXT18",Name="峯大",Text="......是啊,沒錯.就是說呢./n艾可蘿從一開始就告訴過我了.")

Texts[18]=(Label="TEXT19",Name="峯大",Text="就像小真夜有她不能退讓的想法,/n我也有我無法退讓的心情.")

Texts[19]=(Label="TEXT20",Name="峯大",Text="既然雙方都有不能退讓的事物,/n到時就只能正面對決了.")

Texts[20]=(Label="TEXT21",Name="艾可蘿",Text="是不是稍微對我刮目相看了啊?")

Texts[21]=(Label="TEXT22",Name="峯大",Text="是啊,抱歉.是我不對./n艾可蘿是個出色的精英天使哦.")

Texts[22]=(Label="TEXT23",Name="艾可蘿",Text="你能明白就好./n......那麼,你有什麼打算呢?")

Texts[23]=(Label="TEXT24",Name="艾可蘿",Text="看那個樣子,說不定真夜大人/n已經不會再見峯大大人了唷?")

Texts[24]=(Label="TEXT25",Name="峯大",Text="沒問題,我會讓別人聯絡她./n畢竟都到了這種地步,總是得要/n和\"姊姊\"說明纔行呢......")

Texts[25]=(Label="TEXT26",Name="艾可蘿",Text="什麼?")

Texts[26]=(Label="TEXT27",Name="峯大",Text="啊,喂喂?/n我是峯大......")

Texts[27]=(Label="TEXT28",Name="峯大",Text="......嗯,沒錯....../n希望妳能幫我叫真夜去公園.")

Texts[28]=(Label="",Name="",Text="")

Texts[29]=(Label="SELECT01",Name="",Text="")

Texts[30]=(Label="SELECT02",Name="",Text="")

Texts[31]=(Label="SELECT03",Name="",Text="")

Texts[32]=(Label="SELECT04",Name="",Text="")

Texts[33]=(Label="SELECT05",Name="",Text="")

Texts[34]=(Label="SELECT06",Name="",Text="")

Texts[35]=(Label="SELECT07",Name="",Text="")

Texts[36]=(Label="SELECT08",Name="",Text="")

Texts[37]=(Label="SELECT09",Name="",Text="")

Texts[38]=(Label="SELECT10",Name="",Text="")


